Documents/СозданиеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>СозданиеПартии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеПартии</xr:Item>
				<xr:Item>AccumulationRegister.РейтингПользователя</xr:Item>
				<xr:Item>InformationRegister.СостояниеФигур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фигура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клетка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостояниеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПартии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеФигур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеФигур</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взята</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамененаНаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФигур</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамененаНаСимвол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СозданиеПартии/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СостояниеПартии.Записывать = Истина;
	Для Каждого элем Из Доска Цикл
		Движение = Движения.СостояниеПартии.Добавить();
		Движение.Период = Дата;
		Движение.Партия = Партия;
		Движение.Клетка = элем.Клетка;
		Движение.Фигура = элем.Фигура;
	КонецЦикла;	
	
	Движения.СостояниеФигур.Записывать = Истина;
	Для Каждого элем Из Доска Цикл
		Если ЗначениеЗаполнено(элем.Фигура) Тогда
			Движение = Движения.СостояниеФигур.Добавить();
			Движение.Взята	= Ложь;
			Движение.Период = Дата;
			Движение.Партия = Партия;
			Движение.Фигура = элем.Фигура;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
